Catalogs/ИнформационныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ИнформационныеБазы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Кластеры1С</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверБД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерверыБД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначенияИБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиИБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторБазы</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователяИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеВКластере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииКонфигураций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищаКонфигураций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебСервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВебСерверы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнформационнойБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доступ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПользовательГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПользователиИБ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИнформационныеБазы/Forms/ФормаПросмотра/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ТекущаяСтраницаПараметров) Тогда
		
		ТекущаяСтраницаПараметров = "ГруппаИнформация";
		
	КонецЕсли;    
	
	//СводнаяИнформация = Справочники.ИнформационныеБазы.ПолучитьМакет("МакетПоказателей");
	
	//Отладка
	УстановитьОтображениеНезаполненныхЭлементов();	
	
	ЖурналРегистрации = "ClickHouse";
	
	ОбъемБазы = "4.7 Гб (из 11 Гб)";
	КоличествоАктивныхСеансов = 18;
	Объект.ИспользуетсяПо = ТекущаяДата();
	
	ОтобразитьГрафикАктивности();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
КонецПроцедуры   
 
&НаСервере
Процедура УстановитьОтображениеНезаполненныхЭлементов()
	
	ОформлениеСсылки = Новый Структура("Шрифт, ЦветТекста", Новый Шрифт(, 11, , , Истина), ЦветаСтиля.ГиперссылкаЦвет);
	ОформлениеПустойСсылки = Новый Структура("Шрифт, ЦветТекста", Новый Шрифт(, 11, , , Истина), ЦветаСтиля.ЦветПустойГиперссылки);
	
	СписокПроверяемыхРеквизитов = Новый Соответствие;
	СписокПроверяемыхРеквизитов.Вставить("Конфигурация", "ВерсияКонфигурации");
	СписокПроверяемыхРеквизитов.Вставить("ДатаСоздания", "ДатаСоздания");
	СписокПроверяемыхРеквизитов.Вставить("ИспользуетсяПо", "ИспользуетсяПо");
	СписокПроверяемыхРеквизитов.Вставить("НазначениеИБ", "Назначение");
	СписокПроверяемыхРеквизитов.Вставить("Ответственный", "Ответственный");
	СписокПроверяемыхРеквизитов.Вставить("Проект", "Проект");
	СписокПроверяемыхРеквизитов.Вставить("ВебСервер", "ВебСервер");
	СписокПроверяемыхРеквизитов.Вставить("ХранилищеКонфигурации", "ХранилищеКонфигурации");

	Если ЗначениеЗаполнено(Объект.ВерсияКонфигурации) Тогда
		ЭтотОбъект.Конфигурация = Новый ФорматированнаяСтрока(Строка(Объект.ВерсияКонфигурации));
	Иначе                                                                             
		ЭтотОбъект.Конфигурация = Новый ФорматированнаяСтрока(БиблиотекаКартинок.Предупреждение, " <Не заполнено>");
	КонецЕсли;

КонецПроцедуры // УстановитьОтображениеНезаполненныхЭлементов()

&НаКлиенте
Процедура КонфигурацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.ВерсияКонфигурации) Тогда
		
		ОткрытьФорму("Справочник.ВерсииКонфигураций.ФормаОбъекта", 
					Новый Структура("Ключ", Объект.ВерсияКонфигурации), 
					Элемент, ЭтаФорма, 
					, , , 
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе                                                                                                                 
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ИмяЭлемента", "Конфигурация");
		СтруктураПараметров.Вставить("ИмяРеквизита", "ВерсияКонфигурации");
		ОписаниеОпопвещенияВыбора = Новый ОписаниеОповещения("ОбработкаВыбораЗначенияРеквизита", ЭтотОбъект, СтруктураПараметров);
		
		ПараметрыФормыВыбора = Новый Структура;
		ПараметрыФормыВыбора.Вставить("РежимВыбора", Истина);
		
		ОткрытьФорму("Справочник.ВерсииКонфигураций.ФормаВыбора", 
					ПараметрыФормыВыбора, 
					Элемент, ЭтаФорма, 
					, ,
					ОписаниеОпопвещенияВыбора,
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаВыбораЗначенияРеквизита(Результат, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(Результат) Тогда
		Объект[ДополнительныеПараметры.ИмяРеквизита] = Результат;  
		Записать();
		ЭтотОбъект[ДополнительныеПараметры.ИмяЭлемента] = Новый ФорматированнаяСтрока(Строка(Результат), 
																				Новый Шрифт(, 12, , , Истина), 
																				);
	КонецЕсли;	
	
КонецПроцедуры // ОбработкаВыбораЗначенияРеквизита()     

&НаСервере
Процедура ОтобразитьГрафикАктивности()
	
	Справочники.ИнформационныеБазы.ПолучитьГрафикПоказателейАктивности(Объект.Ссылка, СводнаяИнформация);

КонецПроцедуры // ОтобразитьГрафикАктивности()

&НаКлиенте
Процедура КомандаРедактировать(Команда)

	ПолучитьСвойстваИнформационнойБазы();
	//Прототип_ПолучитьПараметрыКонфигурацииНаСервере(Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Прототип_ПолучитьПараметрыКонфигурацииНаСервере(ИнформационнаяБаза)
	
	КаталогФайловБазы = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор()) + ПолучитьРазделительПутиСервера(); 
	
	СоздатьКаталог(КаталогФайловБазы);
	
	
	
	
	УдалитьФайлы(КаталогФайловБазы);	
	

КонецПроцедуры // Прототип_ПолучитьПараметрыКонфигурацииНаСервере()

&НаСервере
Процедура ПолучитьСвойстваИнформационнойБазы()
	
	Отказ = Ложь;
	Адимнистрирование_ИнформационнаяБаза = АдминистрированиеИнформационныхБаз.ПолучитьСвойстваИнформационнойБазы(Объект.Ссылка, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	БлокировкаРегламентныхЗаданий	= Адимнистрирование_ИнформационнаяБаза.БлокировкаРегламентныхЗаданий;
	БлокировкаНачалаСеансов		= Адимнистрирование_ИнформационнаяБаза.ВключенаБлокировкаНачалаСеансов;
	
	СеансыИнформационнойБазы = Адимнистрирование_ИнформационнаяБаза.ПолучитьСеансы();
	КоличествоАктивныхСеансов = СеансыИнформационнойБазы.Количество();	

КонецПроцедуры
